ERP/src/InformationRegisters/ПромокодыПериодДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПромокодыПериодДействия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛист</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПромокодСтрока</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/CommonModules/Промокоды/Ext/Module.bsl
Функция ПолучитьДанныеПоПромокоду(Промокод, ПланПодписки, ДатаПодписки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПромокодыПериодДействия.ПрайсЛист КАК ПрайсЛист,
		|	ПромокодыПериодДействия.Реферал КАК Реферал,
		|	ПромокодыПериодДействия.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПромокодыПериодДействия КАК ПромокодыПериодДействия
		|ГДЕ
		|	ПромокодыПериодДействия.Промокод = &Промокод
		|	И &Дата МЕЖДУ ПромокодыПериодДействия.ДатаНачала И ПромокодыПериодДействия.ДатаОкончания
		|	И ПромокодыПериодДействия.ПрайсЛист.План = &План";
	
	Запрос.УстановитьПараметр("Дата", ДатаПодписки);
	Запрос.УстановитьПараметр("Промокод", Промокод);
	Запрос.УстановитьПараметр("План", ПланПодписки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
    	Возврат Неопределено;
	ИначеЕсли ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат Новый Структура("ПрайсЛист, Реферал, ИсточникПодписки", ВыборкаДетальныеЗаписи.ПрайсЛист, ВыборкаДетальныеЗаписи.Реферал, ВыборкаДетальныеЗаписи.Регистратор);
	Иначе
		ВызватьИсключение "Промокод не уникален!";	
	КонецЕсли;	
	
КонецФункции
